# GetDWGExportOptions Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportDWGSettings..::..GetDWGExportOptions Method
ExportDWGSettings Class See Also
---
Gets the options stored in the these settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public DWGExportOptions GetDWGExportOptions()
```

Visual Basic
---
```text
Public Function GetDWGExportOptions As DWGExportOptions
```

Visual C++
---
```text
public:
DWGExportOptions^ GetDWGExportOptions()
```

# ### Return Value
The options.
# See Also
ExportDWGSettings Class
Autodesk.Revit.DB Namespace